# classwork 1

list = [8,4,2,6]
list.remove(2)
print(len(list) + list.count(6))

#პასუხი იქება 4 რადგან ჩვენ შევქმენით ლისთი(სია) შემდეგ ჩვენ ამოვშალეთ ამ სიიდან მეორე მნიშვნელობა,ანუ 2 და სიაში დარჩა 3 მნიშვნელობა.შემდეგ ჩვენ პრინტში ჩავწერეთ რომ დაგვეთვალა რამდენი მნიშვნელობისგან შედგებოდა ეს სია და ამას დავუმატეთ ის რომ დაეთვალა რამდენი 6-იანია სიაში. ( 3 + 1 = 4 )


# classwork 2

nums = [2,4,8,9,5]

nums.insert(1, 3)
nums.remove(9)
nums.insert(0, nums.count(8))
print(nums[3])

 
 #პასუხი იქნება 2 ცალი 4-იანი იმიტომ რომ ჩვენ შევქმენით სია ,შემდეგ ჩვენ გამოვიყენეთ "insert" - რაც პირველი ინდექსის ადგილზე ჩასვამდა 3 - იანს და ამავდროულად ჩვენ სიაში იგივე რაოდენობის მნიშვნელობები დაგვრჩებოდა.შემდეგ ჩვენ სიიდან ამოვშალეთ 9-იანი და სიაში დარჩა ოთხი მნიშვნელობა.შემდეგ ჩვენ დავთვალეთ სიაში რამდენი 8-იანი იყო - (1).( 3 + 1 = 4 ) 