#sequence - არის პროგრამირების ენაში და არამარტო პროგრამირების ენაში,რაღაცის თანმიმდევრობთ გაკეთება

#interation - არის იგივე loop ანუ რაღაც რაც იმდენჯერ მეორდება რამდენჯერაც მე მსურს და იქამდე სანამ მე მას არ შევწყვეტ ან არ მივცემ ბრძანებას რომ გაჩერდეს.

#selection - არის , იგივე არჩევანი , ანუ ეს ატრიბუტი გვაძლევს იმის საშუალებას რომ ავირჩიოთ რა ბრძანება მივცეთ უშუალოდ კომპიუტერს.


#condition example

age = 25

if age > 0 and age < 12 :
    print("child")

elif age > 13 and age < 18 :
    print("teenager")

if age > 18 :
    print("adult")        


#____________________________________________________________________________________________________________________


count = 50

while count > 2 :
    print("GOA")

count==count - 1  


