def greet_user(name):
    greeting = f'გამარჯობა {name}, კეთილი იყოს შენი მობრძანება, გისურვებ წარმატებას და წინ სვლას'
    return greeting

# გამოყენება
user_name = "თამარი"
print(greet_user(user_name))

# 3

def love_letter(name):
    letter = f"""
ძვირფასო {name},

შენს არსებობას სამყაროს ფერები შემოაქვს, და შენი ღიმილი ჩემს გულში სითბოს აძლიერებს. ყოველი დღე, რომელსაც შენთან ვატარებ, თითქოს პატარა საჩუქარია, რომელიც არასდროს მინდა დასრულდეს. შენ ხარ ჩემი შთაგონება, ჩემი ძალა და ჩემი უდიდესი ბედნიერება.

გთხოვ, იცოდე, რომ რაც არ უნდა მოხდეს, შენ ჩემი გულის ერთგული მეუფე ხარ.  

სიყვარულით {name}
"""
    return letter

# გამოყენება
recipient_name = "ანა"
print(love_letter(recipient_name))


